/**
 * FIXME Пройтись по всем классам и сделать имена, соответствующие общим (например везде использовать name и shortName).
 *
 * FIXME Реализовать свой конвертор и валидатор для GUID.
 *
 * FIXME Добавление справочных значений, вместо идентификаторов.
 * С одной стороны, справочники можно проверить введя например класс References с методами для получения
 * объектов для каждого значения, но с другой стороны, для связи больших данных этот способ уже не подойдёт.
 *
 * FIXME Включить валидацию с использованием BeanValidation.
 *
 * FIXME Сделать все типы сериализуемыми.
 *
 * FIXME Проверка конвертации путём обратного преобразования в xml-строку.
 *
 * FIXME Сделать общего предка для Landmark и HouseInterval.
 */
package ru.gt2.rusref.fias;
